users_input1 = str(input("enter something: "))
print((users_input1  + " ") * 5)
#პირველ ხაზზე დავადეკლარილე სტრინგ ტიპის ცვლადი სახელად users_input1
#ხოლო მნიშვნელობად გადავეცი input რადგან ჩვენ დავალებაში მომხმარებელს 
#უნდა შემოეტანა მნიშვნელობა, მეორე ხაზზე გამოვიძახე ეს ცვლადი print
#ფუნქციის საშვალებით მას დავუმატე space, რადგან შემდეგ 5-ზე უნდა 
#გაგვემრავლებინა ამ ცვლადის მნიშვნელობა რის შედეგაც space-ს გარეშე
#5-ჯერ გადაებმევოდა მნიშვნელობა
users_input2 = int(input("enter number: "))
print(users_input2 * 5)
#მეცხრე ხაზზე დავადეკლარილე ინტეჯერ ტიპის ცვლადი სახელად users_input2
#ხოლო მნიშვნელობად გადავეცი input რადგან ჩვენ დავალებაში მომხმარებელს
#უნდა შემოეტანა მნიშვნელობა, მეორე ხაზზე გამოვიძახე ეს ცვლადი print
#ფუნქციის საშვალებით და შემდეგ გავამრავლე 5-ზე ამ შემთხვევაში ის შეიკრიბება
#რადგან ის არის ინტეჯერი