"" #ორ ბრჭყალებში მოქცეულ მნიშვნელობას ეწოდება string სტრინგს არ აქვს მნიშვნელობა ის არის 
#შეიძლება ითქვას გამოსახულება მაგალითად "10" + "20" = "1020" რადგან ესენი არის სტრინგები ანუ გამოსახულებები
#მაგალითად ესენი რომ იყოს ძეგლები 10-იანის და 20-იანის ჩვენ შეგვეძლება გვერდიგვერდ მივდგათ და 10 და 20
#გვერდიგვერდ იყოს მაგრამ ძეგლებს ახლოს რომ მივწევთ იგივე დარჩება არ შეიცვლება 30-თად ვერ გადაიქცევა

10 #ბრჭყალების გარეშე რიცხვები არიან ინტეჯერები ინტეჯერები ერთმანეთს ემატება მაგალითად ჩვენ ვიცით რომ
#"10" + "20" = "1020" მაგრამ ინტეჯერები გამოსახულებები არ არიან ისინი შეგვიძლია შევკრიბოთ გავამრავლოთ გავყოთ
#და ა.შ ანუ 10 + 20 = 30 (ინტეჯერი არის მთელი რიცხვი)