// სტუდენტისგან შემოტანეთ 3 სხვადასხვა საგნის ქულა, შემდეგ
// გამოითვალეთ საშუალო ქულა და საშუალო ქულის შესაფერისად
// გამოტანეთ შეფასება, თუ სტუდენტის ქულა მეტია 90 -  ზე
// და ნაკლებია 100 - ზე, მაშინ გამოიტანეთ 'A', სხვა შემთხვევაში
// თუ სტუდენტის ქულა მეტია 70 - ზე და ნაკლებია 80 - ზე,
// მაშინ გამოიტანეთ 'B', სხვა შემთხვევაში თუ სტუდენტის
// ქულა მეტია 50 - ზე და ნაკლებია 65 - ზე, მაშინ გამოიტანეთ
// 'C', სხვა შემთხვევაში თუ სტუდენტის ქულა მეტია 25 - ზე და
// ნაკლებია 50 - ზე, მაშინ გამოიტანეთ 'D', ხოლო თუ 25 -  ზე ნაკლებია,
// მაშინ გამოიტანეთ 'წადი ისწავლე და მერე მოდი'
// დრო: 15წთ.
// შემოიტანეთ ისეთი მნიშვნელობები, რომლებიც გამოიტანს ყველა შეფასებას (A,B,C,D, 'წადი ისწავლე და მერე მოდი')

let subject1 = prompt('Enter math grade: ')
let subject2 = prompt('Enter geography grade: ')
let subject3 = prompt('Enter english grade: ')
function subject(grade){
    if (grade > 90 && grade < 100){
        return 'A ყოჩაღ, შენ მიიღე საუკეთესო ქულა'
    } else if (grade > 70 && grade <80){
        return 'B უფრო მეტი ივარჯიშე და საუკეთესო ქულას მიიღებ'
    } else if (grade > 50 && grade < 65){
        return 'C ცუდი შედეგი არაა, მაგრამ უკეთესიც შეიძლებოდა'
    } else if (grade > 25 && grade < 50){
        return 'D გიჭირს ეს საგანი, მეტი იმუშავე'
    } else {
        return 'F წადი ისწავლე და მერე მოდი'
    }
}
console.log(grade(prompt('Enter math grade: ')))
console.log(grade(prompt('Enter geography grade: ')))
console.log(grade(prompt('Enter english grade: ')))