// Ternary Operator
// შექმენით პროგრამა, რომელიც მიიღებს მომხმარებლის ასაკს და გამოცდის შეფასებას (0-დან 100-მდე). გამოიყენეთ ეს კრიტერიუმები:
// თუ მომხმარებელი 18 წლის ან მეტი არის და მისი შეფასება 50-ზე მეტია:   
// დაბეჭდეთ „თქვენ წარმატებული ხართ“
// თუ მომხმარებელი 18 წლის ან მეტი არის და შეფასება 50 - ზე ნაკლებია :
// დაბეჭდეთ -  „გჭირდებათ მეტი სწავლა“
// თუ მომხმარებელი 18 წლის ქვემოთაა:
// დაბეჭდეთ -  „შენც ბავშვი ხარ, მაგრამ შეგიძლია წარმატებას მიაღწიო“
const age = Number(prompt("შეიყვანეთ თქვენი ასაკი:"));
const grade = Number(prompt("შეიყვანეთ თქვენი შეფასება (0-დან 100-მდე):"));
if (age >= 18 && grade >50){
    console.log('თქვენ წარმატებული ხართ')
} else if (age >= 18 && grade < 50){
    console.log('გჭირდებათ მეტი სწავლა')
} else if (age < 18){
    console.log('შენც ბავშვი ხარ, მაგრამ შეგიძლია წარმატებას მიაღწიო')
}